<?php
/** 
 * API编码
 * @version v0.01
 * @package staums\apps\events\code
 * @author lqt
 * 
 * 接口返回码规范
 * 		-1 系统繁忙
 * 		0  请求成功
 * 		1开头的五位数   权限错误码
 * 		4开头的五位数   参数错误码
 * 		6开头的五位数   数据层错误码
 */  
return array(
    '-1' 	=> '系统繁忙！',
    '0'  	=> '请求成功！',
	'40001'	=> '手机号不能为空！',
	'40002'	=> '用途不能为空！',	
	'40003'	=> '请输入正确的手机号！',
	'40004'	=> '短信用途不存在！',
	'40005'	=> '验证码不能为空！',
	'40006'	=> '密码不能为空！',	
	'40007'	=> '密码请输入6-20个字符！',
	'40008'	=> '两次密码不同！',	
	'40009'	=> '用户ID不能为空！',	
	'40010'	=> '头像地址不能为空！',	
	'40011'	=> '请上传文件！',	
	'40012'	=> '房间名称不能为空！',
	'40013'	=> '房间ID不能为空！',
	'40014'	=> '新密码不能为空！',
	'40015'	=> '密码为请输入四位数字！',
	'40016'	=> '信号名称不能为空！',
	'40017'	=> '信号类型不能为空！',
	'40018'	=> '信号ID不能为空！',
	'40019'	=> '设备名称不能为空！',
	'40020'	=> '设备类型不能为空！',
	'40021'	=> '设备ID不能为空！',
	'40022'	=> '主机名称不能为空！',
	'40023'	=> '主机序列号不能为空！',
	'40024'	=> '主机ID不能为空！',
	
	'60001'	=> '用户已存在！',										
	'60002'	=> '用户异常！',
	'60003'	=> '操作频繁，稍后再试！',
	'60004'	=> '一天内最多发送三条短信！',
	'60005'	=> '插入短信日志失败！',
	'60006'	=> '短信发送失败！',		
	'60007'	=> '用户不存在！',	
	'60008'	=> '手机验证码不正确！',	
	'60009'	=> '手机验证码已失效！',
	'60010'	=> '注册失败！',	
	'60011'	=> '密码不正确！',  	
	'60012'	=> '密码重置失败！',
	'60013'	=> '请获取验证码！',	
	'60014'	=> '上传失败，请重新上传！',
	'60015'	=> '更新失败！',
	'60016'	=> '添加失败！',
	'60017'	=> '房间不存在！',
	'60018'	=> '删除失败！',	
	'60019'	=> '修改失败！',
	'60020'	=> '原密码不正确！',	
	'60021'	=> '信号不存在！',	 	
	'60022'	=> '查询失败！',
	'60023'	=> '设备不存在！',	 
	'60024'	=> '主机不存在！',	
	'60025'	=> '开启失败！',
	'60026'	=> '关闭失败！',	 
	 	 	 	 	 	 	 
);